---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedGlazing.GlazingTransmissionRoughness
source: html/cda083b6-1e67-b66c-b88d-f8adf30071cd.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing.GlazingTransmissionRoughness Property

The property labeled "Transmissive roughness" from the "AdvancedGlazing" schema.

## Syntax (C#)
```csharp
public static string GlazingTransmissionRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.